In [1]:
# 数据规整化方面的话题
import numpy as np
import pandas as pd
from datetime import time
from pandas import DataFrame, Series

In [2]:
# 时间序列以及截面对齐

In [3]:
close_px_all = pd.read_csv('../data/stock_px.csv', parse_dates=True, index_col=0)
close_px = close_px_all[['AAPL', 'MSFT', 'XOM', 'IBM', 'SPX']]
print(close_px.head())
print(close_px.tail())

            AAPL  MSFT   XOM    IBM     SPX
1990-02-01  7.86  0.51  6.12  16.79  328.79
1990-02-02  8.00  0.51  6.24  16.89  330.92
1990-02-05  8.18  0.51  6.25  17.32  331.85
1990-02-06  8.12  0.51  6.23  17.56  329.66
1990-02-07  7.77  0.51  6.33  17.93  333.75
              AAPL   MSFT    XOM     IBM      SPX
2011-10-10  388.81  26.94  76.28  186.62  1194.89
2011-10-11  400.29  27.00  76.27  185.00  1195.54
2011-10-12  402.19  26.96  77.16  186.12  1207.25
2011-10-13  408.43  27.18  76.37  186.82  1203.66
2011-10-14  422.00  27.27  78.11  190.53  1224.58

In [4]:
volume_all = pd.read_csv('../data/volume.csv', parse_dates=True, index_col=0)
volume = volume_all[['AAPL', 'MSFT', 'XOM', 'SPX']]
volume.head()

                  AAPL         MSFT        XOM          SPX
1990-02-01   4193200.0   89193600.0  2916400.0  154580000.0
1990-02-02   4248800.0   71395200.0  4250000.0  164400000.0
1990-02-05   3653200.0   59731200.0  5880800.0  130950000.0
1990-02-06   2640000.0   81964800.0  4750800.0  134070000.0
1990-02-07  11180800.0  134150400.0  4124800.0  186710000.0

In [5]:
(close_px * volume).head() # 自动匹配对应位置，计算当天成交所额。IBM没有就填充NA。

                  AAPL  IBM        MSFT           SPX         XOM
1990-02-01  32958552.0  NaN  45488736.0  5.082436e+10  17848368.0
1990-02-02  33990400.0  NaN  36411552.0  5.440325e+10  26520000.0
1990-02-05  29883176.0  NaN  30462912.0  4.345576e+10  36755000.0
1990-02-06  21436800.0  NaN  41802048.0  4.419752e+10  29597484.0
1990-02-07  86874816.0  NaN  68416704.0  6.231446e+10  26109984.0

In [6]:
vwap = (close_px * volume).sum() / volume.sum()
vwap

AAPL      81.246271
IBM             NaN
MSFT      16.923765
SPX     1134.418556
XOM       50.520303
dtype: float64

In [7]:
vwap.dropna()

AAPL      81.246271
MSFT      16.923765
SPX     1134.418556
XOM       50.520303
dtype: float64

In [8]:
tp = close_px.align(volume, join='inner') # 返回与volume对齐的元组
# tp[0]是close_px，tp[1]是volume。
print(tp[0][:10])
print(tp[1][:10])

            AAPL  MSFT   XOM     SPX
1990-02-01  7.86  0.51  6.12  328.79
1990-02-02  8.00  0.51  6.24  330.92
1990-02-05  8.18  0.51  6.25  331.85
1990-02-06  8.12  0.51  6.23  329.66
1990-02-07  7.77  0.51  6.33  333.75
1990-02-08  7.71  0.51  6.35  332.96
1990-02-09  8.00  0.52  6.37  333.62
1990-02-12  7.94  0.52  6.22  330.08
1990-02-13  8.06  0.52  6.23  331.02
1990-02-14  8.00  0.52  6.20  332.01
                  AAPL         MSFT        XOM          SPX
1990-02-01   4193200.0   89193600.0  2916400.0  154580000.0
1990-02-02   4248800.0   71395200.0  4250000.0  164400000.0
1990-02-05   3653200.0   59731200.0  5880800.0  130950000.0
1990-02-06   2640000.0   81964800.0  4750800.0  134070000.0
1990-02-07  11180800.0  134150400.0  4124800.0  186710000.0
1990-02-08   6680000.0   95225600.0  5651200.0  176240000.0
1990-02-09   6004400.0   62380800.0  3384800.0  146910000.0
1990-02-12   2695600.0   56086400.0  2698000.0  118390000.0
1990-02-13   3653600.0   58752000.0  3564800.0  144490000.0
1990-02-14   3448000.0   35868800.0  2830000.0  138530000.0

In [9]:
s1 = Series(range(3), index=['a', 'b', 'c'])
s2 = Series(range(4), index=['d', 'b', 'c', 'e'])
s3 = Series(range(3), index=['f', 'a', 'c'])
df = DataFrame({'one': s1, 'two': s2, 'three': s3})
df

   one  three  two
a  0.0    1.0  NaN
b  1.0    NaN  1.0
c  2.0    2.0  2.0
d  NaN    NaN  0.0
e  NaN    NaN  3.0
f  NaN    0.0  NaN

In [10]:
df = DataFrame({'one': s1, 'two': s2, 'three': s3}, index=list('face')) # 显示定义索引对齐
df

   one  three  two
f  NaN    0.0  NaN
a  0.0    1.0  NaN
c  2.0    2.0  2.0
e  NaN    NaN  3.0

In [11]:
# 频率不同的时间序列的运算

In [12]:
ts1 = Series(np.random.randn(3),
             index=pd.date_range('2012-6-13', periods=3, freq='W-WED'))
ts1

2012-06-13    1.015990
2012-06-20   -0.482544
2012-06-27    0.462347
Freq: W-WED, dtype: float64

In [13]:
ts1 = ts1.resample('B').ffill() # 重新采样，如果没有ffill就需要用ts2.iteritems()遍历访问
ts1

2012-06-13    1.015990
2012-06-14    1.015990
2012-06-15    1.015990
2012-06-18    1.015990
2012-06-19    1.015990
2012-06-20   -0.482544
2012-06-21   -0.482544
2012-06-22   -0.482544
2012-06-25   -0.482544
2012-06-26   -0.482544
2012-06-27    0.462347
Freq: B, dtype: float64

In [14]:
dates = pd.DatetimeIndex(['2012-6-12',
                          '2012-6-17',
                          '2012-6-18',
                          '2012-6-21',
                          '2012-6-22',
                          '2012-6-29'])
ts2 = Series(np.random.randn(6), index=dates)
ts2

2012-06-12   -0.182721
2012-06-17   -0.453785
2012-06-18   -0.881897
2012-06-21    0.962825
2012-06-22    1.006743
2012-06-29    0.196376
dtype: float64

In [15]:
ts2 + ts1.reindex(ts2.index, method='ffill') # ts1的索引先和ts2对齐，然后相加。

2012-06-12         NaN
2012-06-17    0.562204
2012-06-18    0.134092
2012-06-21    0.480281
2012-06-22    0.524199
2012-06-29    0.658723
dtype: float64

In [16]:
# 使用Period

In [17]:
gdp = Series([1.78, 1.94, 2.08, 2.01, 2.15, 2.31, 2.46],
             index=pd.period_range('1984Q2', periods=7, freq='Q-SEP'))
gdp

1984Q2    1.78
1984Q3    1.94
1984Q4    2.08
1985Q1    2.01
1985Q2    2.15
1985Q3    2.31
1985Q4    2.46
Freq: Q-SEP, dtype: float64

In [18]:
infl = Series([0.025, 0.045, 0.037, 0.04],
              index=pd.period_range('1982', periods=4, freq='A-DEC'))
infl # 显然和gdp的时间频率不一样

1982    0.025
1983    0.045
1984    0.037
1985    0.040
Freq: A-DEC, dtype: float64

In [19]:
infl_q = infl.asfreq('Q-SEP', how='end') # 调整季度
infl_q

1983Q1    0.025
1984Q1    0.045
1985Q1    0.037
1986Q1    0.040
Freq: Q-SEP, dtype: float64

In [20]:
infl_q.reindex(gdp.index, method='ffill') # 索引匹配并且填充缺失值

1984Q2    0.045
1984Q3    0.045
1984Q4    0.045
1985Q1    0.037
1985Q2    0.037
1985Q3    0.037
1985Q4    0.037
Freq: Q-SEP, dtype: float64

In [21]:
# 时间和“最当前”数据选取

In [22]:
rng = pd.date_range('2012-06-01 09:30', '2012-06-01 15:59', freq='T') # 交易时段按分钟采样
rng = rng.append([rng + pd.offsets.BDay(i) for i in range(1, 4)]) # 再补4天
ts = Series(np.arange(len(rng), dtype=float), index=rng)
print(ts.head())
print(ts.tail())

2012-06-01 09:30:00    0.0
2012-06-01 09:31:00    1.0
2012-06-01 09:32:00    2.0
2012-06-01 09:33:00    3.0
2012-06-01 09:34:00    4.0
dtype: float64
2012-06-06 15:55:00    1555.0
2012-06-06 15:56:00    1556.0
2012-06-06 15:57:00    1557.0
2012-06-06 15:58:00    1558.0
2012-06-06 15:59:00    1559.0
dtype: float64

In [23]:
ts[time(10, 0)] # 抽取10点的数据

2012-06-01 10:00:00      30.0
2012-06-04 10:00:00     420.0
2012-06-05 10:00:00     810.0
2012-06-06 10:00:00    1200.0
dtype: float64

In [24]:
ts.at_time(time(10, 0)) # 和上面等价

2012-06-01 10:00:00      30.0
2012-06-04 10:00:00     420.0
2012-06-05 10:00:00     810.0
2012-06-06 10:00:00    1200.0
dtype: float64

In [25]:
ts.between_time(time(10, 0), time(10, 1)) # 定位到时间段

2012-06-01 10:00:00      30.0
2012-06-01 10:01:00      31.0
2012-06-04 10:00:00     420.0
2012-06-04 10:01:00     421.0
2012-06-05 10:00:00     810.0
2012-06-05 10:01:00     811.0
2012-06-06 10:00:00    1200.0
2012-06-06 10:01:00    1201.0
dtype: float64

In [26]:
indexer = np.sort(np.random.permutation(1560)[700:]) # 根据ts随机选个排列，并选择700条及以后的数据排序。
irr_ts = ts.copy()
irr_ts[indexer] = np.nan # 根据随机下标索引把一部分时间点数据设置为NA
irr_ts['2012-06-01 09:50':'2012-06-01 10:00']

2012-06-01 09:50:00    20.0
2012-06-01 09:51:00     NaN
2012-06-01 09:52:00     NaN
2012-06-01 09:53:00    23.0
2012-06-01 09:54:00     NaN
2012-06-01 09:55:00    25.0
2012-06-01 09:56:00     NaN
2012-06-01 09:57:00     NaN
2012-06-01 09:58:00     NaN
2012-06-01 09:59:00     NaN
2012-06-01 10:00:00    30.0
dtype: float64

In [27]:
selection = pd.date_range('2012-06-01 10:00', periods=4, freq='B') # 连续4个工作日的上午10点
selection

DatetimeIndex(['2012-06-01 10:00:00', '2012-06-04 10:00:00',
               '2012-06-05 10:00:00', '2012-06-06 10:00:00'],
              dtype='datetime64[ns]', freq='B')

In [28]:
irr_ts.asof(selection) # 上面多随机几次，确保某个10点数据为NA。asof的话会拿最近数据填充。

2012-06-01 10:00:00      30.0
2012-06-04 10:00:00     420.0
2012-06-05 10:00:00     808.0
2012-06-06 10:00:00    1200.0
Freq: B, dtype: float64

In [29]:
# 拼接多个数据源

In [30]:
data1 = DataFrame(np.ones((6, 3), dtype=float),
                  columns=['a', 'b', 'c'],
                  index=pd.date_range('6/12/2012', periods=6))
data2 = DataFrame(np.ones((6, 3), dtype=float) * 2,
                  columns=['a', 'b', 'c'],
                  index=pd.date_range('6/13/2012', periods=6))
spliced = pd.concat([data1.loc[:'2012-06-14'], data2.loc['2012-06-15':]]) # 默认纵向连接
spliced

              a    b    c
2012-06-12  1.0  1.0  1.0
2012-06-13  1.0  1.0  1.0
2012-06-14  1.0  1.0  1.0
2012-06-15  2.0  2.0  2.0
2012-06-16  2.0  2.0  2.0
2012-06-17  2.0  2.0  2.0
2012-06-18  2.0  2.0  2.0

In [31]:
data2 = DataFrame(np.ones((6, 4), dtype=float) * 2,
                  columns=['a', 'b', 'c', 'd'],
                  index=pd.date_range('6/13/2012', periods=6))
spliced = pd.concat([data1.loc[:'2012-06-14'], data2.loc['2012-06-15':]])
spliced # data1没有d列

              a    b    c    d
2012-06-12  1.0  1.0  1.0  NaN
2012-06-13  1.0  1.0  1.0  NaN
2012-06-14  1.0  1.0  1.0  NaN
2012-06-15  2.0  2.0  2.0  2.0
2012-06-16  2.0  2.0  2.0  2.0
2012-06-17  2.0  2.0  2.0  2.0
2012-06-18  2.0  2.0  2.0  2.0

In [32]:
spliced_filled = spliced.combine_first(data2) # 用data2每一行对应列上的值去填充NA
spliced_filled

              a    b    c    d
2012-06-12  1.0  1.0  1.0  NaN
2012-06-13  1.0  1.0  1.0  2.0
2012-06-14  1.0  1.0  1.0  2.0
2012-06-15  2.0  2.0  2.0  2.0
2012-06-16  2.0  2.0  2.0  2.0
2012-06-17  2.0  2.0  2.0  2.0
2012-06-18  2.0  2.0  2.0  2.0

In [33]:
spliced.update(data2, overwrite=False)
spliced

              a    b    c    d
2012-06-12  1.0  1.0  1.0  NaN
2012-06-13  1.0  1.0  1.0  2.0
2012-06-14  1.0  1.0  1.0  2.0
2012-06-15  2.0  2.0  2.0  2.0
2012-06-16  2.0  2.0  2.0  2.0
2012-06-17  2.0  2.0  2.0  2.0
2012-06-18  2.0  2.0  2.0  2.0

In [34]:
cp_spliced = spliced.copy()
cp_spliced

              a    b    c    d
2012-06-12  1.0  1.0  1.0  NaN
2012-06-13  1.0  1.0  1.0  2.0
2012-06-14  1.0  1.0  1.0  2.0
2012-06-15  2.0  2.0  2.0  2.0
2012-06-16  2.0  2.0  2.0  2.0
2012-06-17  2.0  2.0  2.0  2.0
2012-06-18  2.0  2.0  2.0  2.0

In [35]:
cp_spliced[['a', 'c']] = data1[['a', 'c']]
cp_spliced # data1没有18号的数据

              a    b    c    d
2012-06-12  1.0  1.0  1.0  NaN
2012-06-13  1.0  1.0  1.0  2.0
2012-06-14  1.0  1.0  1.0  2.0
2012-06-15  1.0  2.0  1.0  2.0
2012-06-16  1.0  2.0  1.0  2.0
2012-06-17  1.0  2.0  1.0  2.0
2012-06-18  NaN  2.0  NaN  2.0

In [36]:
# 收益指数和累计收益

In [37]:
close_px_all = pd.read_csv('../data/stock_px.csv', parse_dates=True, index_col=0) # 重新读取数据
close_px = close_px_all[['AAPL', 'MSFT', 'XOM', 'IBM', 'SPX']]
price = close_px['AAPL']
price.tail()

2011-10-10    388.81
2011-10-11    400.29
2011-10-12    402.19
2011-10-13    408.43
2011-10-14    422.00
Name: AAPL, dtype: float64

In [38]:
price['2011-10-03'] / price['2011-3-01'] - 1 # 计算回报率

0.072399874037388123

In [39]:
df = DataFrame({'close_price': price})
df.tail()

            close_price
2011-10-10       388.81
2011-10-11       400.29
2011-10-12       402.19
2011-10-13       408.43
2011-10-14       422.00

In [40]:
returns = df.pct_change()['close_price']
(1 + returns).head()

1990-02-01         NaN
1990-02-02    1.017812
1990-02-05    1.022500
1990-02-06    0.992665
1990-02-07    0.956897
Name: close_price, dtype: float64

In [41]:
ret_index = (1 + returns).cumprod()
ret_index[0] = 1
ret_index.head()

1990-02-01    1.000000
1990-02-02    1.017812
1990-02-05    1.040712
1990-02-06    1.033079
1990-02-07    0.988550
Name: close_price, dtype: float64

In [42]:
ret_index.resample('BM').last()['2011'] # 2011年每月相对于基准月（1990/2）的收益

2011-01-31    43.170483
2011-02-28    44.937659
2011-03-31    44.339695
2011-04-29    44.545802
2011-05-31    44.253181
2011-06-30    42.706107
2011-07-29    49.679389
2011-08-31    48.960560
2011-09-30    48.513995
2011-10-31    53.689567
Freq: BM, Name: close_price, dtype: float64

In [43]:
m_rets = (1 + returns).resample('M', kind='period').prod() # 每个月的收益率
m_rets['2011']

2011-01    1.051959
2011-02    1.040935
2011-03    0.986693
2011-04    1.004648
2011-05    0.993431
2011-06    0.965040
2011-07    1.163285
2011-08    0.985531
2011-09    0.990879
2011-10    1.106682
Freq: M, Name: close_price, dtype: float64

In [44]:
# 因为yahoo接口挂了，最后分红的例子就不演示了，原理是一样的。